Обработки/Reports/_ДвиженияПоПартиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДвиженияПоПартиям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДвиженияПоПартиям/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Движения по партиям",
		"0.07",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;	
	Сформировать(ДокументРезультат);
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры


Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	
	Возврат Настройки;

КонецФункции

Процедура Сформировать(ДокументРезультат) Экспорт
	
	ДокументРезультат.Очистить();
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
		                     
	ТаблицаСтоимостей =	ПолучитьТаблицуСтоимостей();
		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(РегистрацияСтоимостиПереоценки.Дата) КАК Дата
		|ПОМЕСТИТЬ _ДатаРСП
		|ИЗ
		|	Документ.РегистрацияСтоимостиПереоценки КАК РегистрацияСтоимостиПереоценки
		|ГДЕ
		|	РегистрацияСтоимостиПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И РегистрацияСтоимостиПереоценки.Проведен
		|	И РегистрацияСтоимостиПереоценки.Дата <= КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|	И РегистрацияСтоимостиПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрацияСтоимостиПереоценки.Ссылка КАК ДокументРСП
		|ПОМЕСТИТЬ _ДокументРСП
		|ИЗ
		|	Документ.РегистрацияСтоимостиПереоценки КАК РегистрацияСтоимостиПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДатаРСП КАК _ДатаРСП
		|		ПО (_ДатаРСП.Дата = РегистрацияСтоимостиПереоценки.Дата)
		|			И (РегистрацияСтоимостиПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|			И (РегистрацияСтоимостиПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет))
		|			И (РегистрацияСтоимостиПереоценки.Проведен)
		|			И (РегистрацияСтоимостиПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Партия КАК Партия,
		|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.СтрокаПартии КАК СтрокаПартии,
		|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Цена КАК Цена,
		|	РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.ДатаЦены КАК ДатаЦены
		|ПОМЕСТИТЬ _РСП
		|ИЗ
		|	Документ.РегистрацияСтоимостиПереоценки.СтоимостиПереоценки КАК РегистрацияСтоимостиПереоценкиСтоимостиПереоценки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДокументРСП КАК _ДокументРСП
		|		ПО (_ДокументРСП.ДокументРСП = РегистрацияСтоимостиПереоценкиСтоимостиПереоценки.Ссылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЦеннаяБумага,
		|	Партия,
		|	СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ВнешняяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ВнешняяТаблица.ЦенаКотировки КАК ЦенаКотировки,
		|	_ВнешняяТаблица.ДатаЦены КАК ДатаЦены,
		|	_ВнешняяТаблица.ВалютаКотировки КАК ВалютаКотировки
		|ПОМЕСТИТЬ _ПереоценкаЦенныхБумагБезПослабления
		|ИЗ
		|	&ВнешняяТаблица КАК _ВнешняяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РСП.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_РСП.Партия КАК Партия,
		|	_РСП.СтрокаПартии КАК СтрокаПартии,
		|	ЕСТЬNULL(_ПереоценкаЦенныхБумагБезПослабления.ЦенаКотировки, _РСП.Цена) КАК ЦенаКотировки,
		|	ЕСТЬNULL(_ПереоценкаЦенныхБумагБезПослабления.ДатаЦены, _РСП.ДатаЦены) КАК ДатаЦены
		|ПОМЕСТИТЬ _ЦенныеБумагиЦены
		|ИЗ
		|	_РСП КАК _РСП
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПереоценкаЦенныхБумагБезПослабления КАК _ПереоценкаЦенныхБумагБезПослабления
		|		ПО _РСП.ЦеннаяБумага = _ПереоценкаЦенныхБумагБезПослабления.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияОферт.Облигация КАК Облигация,
		|	МИНИМУМ(УсловияОферт.ДатаВыкупа) КАК ДатаБлижайшейОферты
		|ПОМЕСТИТЬ _УсловияОферт
		|ИЗ
		|	РегистрСведений.УсловияОферт КАК УсловияОферт
		|ГДЕ
		|	УсловияОферт.ДатаВыкупа > &ДатаОкончания
		|	И НЕ УсловияОферт.ТолькоДляФизическихЛиц
		|
		|СГРУППИРОВАТЬ ПО
		|	УсловияОферт.Облигация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Эмитент КАК Эмитент,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашенияОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.УчетныйАктивЦБРФ КАК ЦеннаяБумагаУчетныйАктивЦБРФ,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Тип КАК ЦеннаяБумагаТип,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ДатаПогашения, """") КАК ДатаПогашения,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала КАК ЦеннаяБумагаВалютаНоминала,
		|	БухПартииЦенныхБумагОстатки.Партия.Основание КАК Основание,
		|	ЛОЖЬ КАК ПризнакПартииРепо,
		|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, БухПартииЦенныхБумагОстатки.Партия.Дата) КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ОстаткиПартийЦБ
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаОкончанияГраница,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Эмитент,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.УчетныйАктивЦБРФ,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Тип,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Наименование,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ДатаПогашения, """"),
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала,
		|	БухПартииЦенныхБумагОстатки.Партия.Основание,
		|	ИСТИНА,
		|	БухПартииЦенныхБумагОстатки.Партия.Дата,
		|	&УчетныйАктивЕПС_РЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
		|			&ДатаОкончанияГраница,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	ЦеннаяБумага,
		|	СтрокаПартии,
		|	Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии КАК СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Эмитент КАК Эмитент,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиОстаток КАК СтоимостьПокупкиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьПокупкиКупонаОстаток КАК СтоимостьПокупкиКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.РасходыПриПокупкеВСтоимостиОстаток КАК РасходыПриПокупкеВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаВСтоимостиОстаток КАК ПереоценкаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВСтоимостиОстаток КАК ПереоценкаКупонаВСтоимостиОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток КАК СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток КАК ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток КАК ПереоценкаКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияОстаток КАК ДисконтПремияОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПОстаток КАК КорректировкаЭСПОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаЧастичногоПогашенияОстаток КАК СуммаЧастичногоПогашенияОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеКупонаОстаток КАК СуммаРезервовПодОбесценениеКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйОстаток КАК ДисконтПремияНачисленныйОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток КАК ПереоценкаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток КАК ПереоценкаКупонаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ДисконтПремияНачисленныйСНачалаГодаОстаток КАК ДисконтПремияНачисленныйСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.КорректировкаЭСПСНачалаГодаОстаток КАК КорректировкаЭСПСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.УчетныйАктивЦБРФ КАК ЦеннаяБумагаУчетныйАктивЦБРФ,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Тип КАК ЦеннаяБумагаТип,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ДатаПогашения, """") КАК ДатаПогашения,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала КАК ЦеннаяБумагаВалютаНоминала,
		|	БухПартииЦенныхБумагОстатки.Партия.Основание КАК Основание,
		|	ЛОЖЬ КАК ПризнакПартииРепо,
		|	ЕСТЬNULL(ВводЦенныхБумагЦенныеБумаги.ДатаПокупки, БухПартииЦенныхБумагОстатки.Партия.Дата) КАК ДатаПокупки,
		|	БухПартииЦенныхБумагОстатки.УчетныйАктивЕПС КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ОстаткиПартийЦБНачало
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстатки.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстатки.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.НомерСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОстатки.Партия,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОстатки.СтрокаПартии,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Эмитент,
		|	БухПартииЦенныхБумагОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.СтоимостьОстаток,
		|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаСНачалаГодаОстаток,
		|	БухПартииЦенныхБумагОстатки.ПереоценкаКупонаСНачалаГодаОстаток,
		|	0,
		|	0,
		|	БухПартииЦенныхБумагОстатки.СчетДоверительногоУправления,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.УчетныйАктивЦБРФ,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Тип,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ГосударственныйРегистрационныйНомер,
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.Наименование,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ДатаПогашения, """"),
		|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага.ВалютаНоминала,
		|	БухПартииЦенныхБумагОстатки.Партия.Основание,
		|	ИСТИНА,
		|	БухПартииЦенныхБумагОстатки.Партия.Дата,
		|	&УчетныйАктивЕПС_РЕПО
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Остатки(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухПартииЦенныхБумагОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	ЦеннаяБумага,
		|	СтрокаПартии,
		|	Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОбороты.Период КАК Период,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	БухПартииЦенныхБумагОбороты.Партия КАК Партия,
		|	БухПартииЦенныхБумагОбороты.СтрокаПартии КАК СтрокаПартии,
		|	СУММА(БухПартииЦенныхБумагОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	СУММА(БухПартииЦенныхБумагОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(БухПартииЦенныхБумагОбороты.СтоимостьПокупкиПриход) КАК СтоимостьПокупкиПриход,
		|	СУММА(БухПартииЦенныхБумагОбороты.СтоимостьПокупкиКупонаПриход) КАК СтоимостьПокупкиКупонаПриход,
		|	СУММА(БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаРасход) КАК ПереоценкаПродажа,
		|	СУММА(БухПартииЦенныхБумагОбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ДисконтПремияНачисленныйВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.КорректировкаЭСПВВалютеУчетаРасход) КАК СтоимостьРасход,
		|	СУММА(БухПартииЦенныхБумагОбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагОбороты.ПереоценкаКупонаВВалютеУчетаРасход) КАК КупонРасход,
		|	БухПартииЦенныхБумагОбороты.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага.Эмитент КАК Эмитент,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОбороты.ЦеннаяБумага.ДатаПогашения, """") КАК ДатаПогашения,
		|	БухПартииЦенныхБумагОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _Обороты
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончанияГраница,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОбороты
		|ГДЕ
		|	НЕ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ПереоценкаЦенныхБумаг
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагОбороты.Период,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага,
		|	БухПартииЦенныхБумагОбороты.Партия,
		|	БухПартииЦенныхБумагОбороты.СтрокаПартии,
		|	БухПартииЦенныхБумагОбороты.УчетныйАктивЕПС,
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага.Эмитент,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОбороты.ЦеннаяБумага.ДатаПогашения, """"),
		|	БухПартииЦенныхБумагОбороты.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Период,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Партия,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтрокаПартии,
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.КоличествоПриход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.КоличествоРасход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтоимостьВВалютеУчетаПриход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтоимостьКупонаВВалютеУчетаПриход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ПереоценкаВВалютеУчетаРасход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтоимостьВВалютеУчетаРасход + БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ПереоценкаВВалютеУчетаРасход),
		|	СУММА(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтоимостьКупонаВВалютеУчетаРасход + БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ПереоценкаКупонаВВалютеУчетаРасход),
		|	&УчетныйАктивЕПС_РЕПО,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага.Эмитент,
		|	ЕСТЬNULL(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага.ДатаПогашения, """"),
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Регистратор
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумагКупленныеПоРЕПО.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончанияГраница,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагКупленныеПоРЕПООбороты
		|ГДЕ
		|	НЕ БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Регистратор ССЫЛКА Документ.ПереоценкаЦенныхБумаг
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Период,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Партия,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.СтрокаПартии,
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага.Эмитент,
		|	ЕСТЬNULL(БухПартииЦенныхБумагКупленныеПоРЕПООбороты.ЦеннаяБумага.ДатаПогашения, """"),
		|	БухПартииЦенныхБумагКупленныеПоРЕПООбороты.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Обороты.Период КАК Период,
		|	_Обороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Обороты.Партия КАК Партия,
		|	_Обороты.СтрокаПартии КАК СтрокаПартии,
		|	_Обороты.КоличествоПриход КАК КоличествоПриход,
		|	_Обороты.СтоимостьПокупкиПриход КАК СтоимостьПокупкиПриход,
		|	_Обороты.СтоимостьПокупкиКупонаПриход / _Обороты.КоличествоПриход КАК НКД_1едПриход,
		|	_Обороты.СтоимостьПокупкиКупонаПриход КАК СтоимостьПокупкиКупонаПриход,
		|	_Обороты.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_Обороты.Эмитент КАК Эмитент,
		|	_Обороты.ДатаПогашения КАК ДатаПогашения
		|ПОМЕСТИТЬ _ДанныеПокупки
		|ИЗ
		|	_Обороты КАК _Обороты
		|ГДЕ
		|	_Обороты.КоличествоПриход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Обороты.Период КАК Период,
		|	_Обороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Обороты.Партия КАК Партия,
		|	_Обороты.СтрокаПартии КАК СтрокаПартии,
		|	СУММА(_Обороты.КоличествоРасход) КАК КоличествоРасход,
		|	СУММА(_Обороты.ПереоценкаПродажа) КАК ПереоценкаПродажа,
		|	СУММА(_Обороты.СтоимостьРасход) КАК СтоимостьРасход,
		|	СУММА(_Обороты.КупонРасход) КАК КупонРасход,
		|	_Обороты.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_Обороты.Эмитент КАК Эмитент,
		|	_Обороты.ДатаПогашения КАК ДатаПогашения
		|ПОМЕСТИТЬ _ДанныеПродажиСвернуто
		|ИЗ
		|	_Обороты КАК _Обороты
		|ГДЕ
		|	(_Обороты.КоличествоРасход > 0
		|			ИЛИ _Обороты.КоличествоРасход = 0
		|				И (_Обороты.СтоимостьРасход > 0
		|					ИЛИ _Обороты.КупонРасход > 0))
		|
		|СГРУППИРОВАТЬ ПО
		|	_Обороты.Период,
		|	_Обороты.ЦеннаяБумага,
		|	_Обороты.Партия,
		|	_Обороты.СтрокаПартии,
		|	_Обороты.УчетныйАктивЕПС,
		|	_Обороты.Эмитент,
		|	_Обороты.ДатаПогашения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПродажиСвернуто.Период КАК Период,
		|	_ДанныеПродажиСвернуто.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДанныеПродажиСвернуто.Партия КАК Партия,
		|	_ДанныеПродажиСвернуто.СтрокаПартии КАК СтрокаПартии,
		|	_ДанныеПродажиСвернуто.КоличествоРасход КАК КоличествоРасход,
		|	_ДанныеПродажиСвернуто.ПереоценкаПродажа КАК ПереоценкаПродажа,
		|	_ДанныеПродажиСвернуто.СтоимостьРасход КАК СтоимостьРасход,
		|	ВЫБОР
		|		КОГДА _ДанныеПродажиСвернуто.КоличествоРасход > 0
		|			ТОГДА _ДанныеПродажиСвернуто.КупонРасход / _ДанныеПродажиСвернуто.КоличествоРасход
		|		ИНАЧЕ ПогашениеКупона.СуммаНаОднуОблигацию
		|	КОНЕЦ КАК НКД_1едРасход,
		|	_ДанныеПродажиСвернуто.КупонРасход КАК КупонРасход,
		|	_ДанныеПродажиСвернуто.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ДанныеПродажиСвернуто.Эмитент КАК Эмитент,
		|	_ДанныеПродажиСвернуто.ДатаПогашения КАК ДатаПогашения
		|ПОМЕСТИТЬ _ДанныеПродажи
		|ИЗ
		|	_ДанныеПродажиСвернуто КАК _ДанныеПродажиСвернуто
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеКупона КАК ПогашениеКупона
		|		ПО _ДанныеПродажиСвернуто.Период = ПогашениеКупона.Дата
		|			И _ДанныеПродажиСвернуто.ЦеннаяБумага = ПогашениеКупона.Облигация
		|			И (ПогашениеКупона.СчетДоверительногоУправления = &СчетДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.Эмитент, _ОстаткиПартийЦБ.Эмитент) КАК Эмитент,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.Партия, _ОстаткиПартийЦБ.Партия) КАК Партия,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.ЦеннаяБумага, _ОстаткиПартийЦБ.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.СтрокаПартии, _ОстаткиПартийЦБ.СтрокаПартии) КАК СтрокаПартии,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.КоличествоОстаток, 0) КАК КоличествоНачало,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ОстаткиПартийЦБНачало.КоличествоОстаток, 0) > 0
		|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(_ОстаткиПартийЦБНачало.СтоимостьПокупкиОстаток, 0) / _ОстаткиПартийЦБНачало.КоличествоОстаток КАК ЧИСЛО(27, 12))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПокупки,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ОстаткиПартийЦБНачало.КоличествоОстаток, 0) > 0
		|			ТОГДА ЕСТЬNULL(_ОстаткиПартийЦБНачало.СтоимостьПокупкиКупонаОстаток, 0) / _ОстаткиПартийЦБНачало.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НКД_1едНачало,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.СтоимостьПокупкиКупонаОстаток, _ОстаткиПартийЦБ.СтоимостьПокупкиКупонаОстаток) КАК СтоимостьПокупкиКупон,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.ПереоценкаОстаток, 0) КАК ПереоценкаНачало,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.СтоимостьПокупкиОстаток, _ОстаткиПартийЦБ.СтоимостьПокупкиОстаток) КАК СтоимостьПокупки,
		|	ЕСТЬNULL(_ОстаткиПартийЦБ.СтоимостьКупонаОстаток, 0) + ЕСТЬNULL(_ОстаткиПартийЦБ.ПереоценкаКупонаОстаток, 0) КАК СтоимостьКупонаКонец,
		|	ЕСТЬNULL(_ОстаткиПартийЦБ.ПереоценкаОстаток, 0) КАК ПереоценкаКонец,
		|	ЕСТЬNULL(_ОстаткиПартийЦБ.СтоимостьОстаток, 0) + ЕСТЬNULL(_ОстаткиПартийЦБ.ПереоценкаОстаток, 0) + ЕСТЬNULL(_ОстаткиПартийЦБ.ДисконтПремияНачисленныйОстаток, 0) + ЕСТЬNULL(_ОстаткиПартийЦБ.КорректировкаЭСПОстаток, 0) КАК СтоимостьКонец,
		|	ЕСТЬNULL(_ОстаткиПартийЦБ.КоличествоОстаток, 0) КАК КоличествоКонец,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_ОстаткиПартийЦБ.КоличествоОстаток, 0) > 0
		|			ТОГДА (ЕСТЬNULL(_ОстаткиПартийЦБ.СтоимостьКупонаОстаток, 0) + ЕСТЬNULL(_ОстаткиПартийЦБ.ПереоценкаКупонаОстаток, 0)) / _ОстаткиПартийЦБ.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НКД_1едКонец,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.ДатаПогашения, _ОстаткиПартийЦБ.ДатаПогашения) КАК ДатаПогашения,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.ДатаПокупки, _ОстаткиПартийЦБ.ДатаПокупки) КАК ДатаПокупки,
		|	ЕСТЬNULL(_ОстаткиПартийЦБНачало.УчетныйАктивЕПС, _ОстаткиПартийЦБ.УчетныйАктивЕПС) КАК УчетныйАктивЕПС
		|ПОМЕСТИТЬ _ОстаткиНачалоКонец
		|ИЗ
		|	_ОстаткиПартийЦБНачало КАК _ОстаткиПартийЦБНачало
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ОстаткиПартийЦБ КАК _ОстаткиПартийЦБ
		|		ПО _ОстаткиПартийЦБНачало.Партия = _ОстаткиПартийЦБ.Партия
		|			И _ОстаткиПартийЦБНачало.ЦеннаяБумага = _ОстаткиПартийЦБ.ЦеннаяБумага
		|			И _ОстаткиПартийЦБНачало.СтрокаПартии = _ОстаткиПартийЦБ.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.Эмитент, _ДанныеПокупки.Эмитент) КАК Эмитент,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.Партия, _ДанныеПокупки.Партия) КАК Партия,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ЦеннаяБумага, _ДанныеПокупки.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.СтрокаПартии, _ДанныеПокупки.СтрокаПартии) КАК СтрокаПартии,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.КоличествоНачало, 0) КАК КоличествоНачало,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ЦенаПокупки, 0) КАК ЦенаПокупки,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.НКД_1едНачало, 0) КАК НКД_1едНачало,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.СтоимостьПокупкиКупон, 0) КАК СтоимостьПокупкиКупон,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ПереоценкаНачало, 0) КАК ПереоценкаНачало,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.СтоимостьПокупки, 0) КАК СтоимостьПокупки,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.НКД_1едКонец, 0) КАК НКД_1едКонец,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.СтоимостьКупонаКонец, 0) КАК СтоимостьКупонаКонец,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ПереоценкаКонец, 0) КАК ПереоценкаКонец,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.СтоимостьКонец, 0) КАК СтоимостьКонец,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.КоличествоКонец, 0) КАК КоличествоКонец,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ДатаПогашения, _ДанныеПокупки.ДатаПогашения) КАК ДатаПогашения,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.ДатаПокупки, _ДанныеПокупки.Период) КАК ДатаПокупки,
		|	ЕСТЬNULL(_ОстаткиНачалоКонец.УчетныйАктивЕПС, _ДанныеПокупки.УчетныйАктивЕПС) КАК УчетныйАктивЕПС,
		|	ЕСТЬNULL(_ДанныеПокупки.КоличествоПриход, 0) КАК КоличествоПриход,
		|	ЕСТЬNULL(_ДанныеПокупки.НКД_1едПриход, 0) КАК НКД_1едПриход,
		|	ЕСТЬNULL(_ДанныеПокупки.СтоимостьПокупкиПриход, 0) КАК СтоимостьПокупкиПериод,
		|	ЕСТЬNULL(_ДанныеПокупки.СтоимостьПокупкиКупонаПриход, 0) КАК СтоимостьПокупкиКупонПериод
		|ПОМЕСТИТЬ _ОстаткиИПокупки
		|ИЗ
		|	_ОстаткиНачалоКонец КАК _ОстаткиНачалоКонец
		|		ПОЛНОЕ СОЕДИНЕНИЕ _ДанныеПокупки КАК _ДанныеПокупки
		|		ПО _ОстаткиНачалоКонец.ЦеннаяБумага = _ДанныеПокупки.ЦеннаяБумага
		|			И _ОстаткиНачалоКонец.Партия = _ДанныеПокупки.Партия
		|			И _ОстаткиНачалоКонец.СтрокаПартии = _ДанныеПокупки.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиИПокупки.Эмитент КАК Эмитент,
		|	_ОстаткиИПокупки.Партия КАК Партия,
		|	_ОстаткиИПокупки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ОстаткиИПокупки.СтрокаПартии КАК СтрокаПартии,
		|	_ОстаткиИПокупки.КоличествоНачало КАК КоличествоНачало,
		|	_ОстаткиИПокупки.ЦенаПокупки КАК ЦенаПокупки,
		|	_ОстаткиИПокупки.НКД_1едНачало КАК НКД_1едНачало,
		|	_ОстаткиИПокупки.СтоимостьПокупкиКупон КАК СтоимостьПокупкиКупон,
		|	_ОстаткиИПокупки.ПереоценкаНачало КАК ПереоценкаНачало,
		|	_ОстаткиИПокупки.СтоимостьПокупки КАК СтоимостьПокупки,
		|	_ОстаткиИПокупки.НКД_1едКонец КАК НКД_1едКонец,
		|	_ОстаткиИПокупки.СтоимостьКупонаКонец КАК СтоимостьКупонаКонец,
		|	_ОстаткиИПокупки.СтоимостьКонец КАК СтоимостьКонец,
		|	_ОстаткиИПокупки.ПереоценкаКонец КАК ПереоценкаКонец,
		|	_ОстаткиИПокупки.КоличествоКонец КАК КоличествоКонец,
		|	_ОстаткиИПокупки.ДатаПогашения КАК ДатаПогашения,
		|	_ОстаткиИПокупки.ДатаПокупки КАК ДатаПокупки,
		|	_ОстаткиИПокупки.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	_ОстаткиИПокупки.КоличествоПриход КАК КоличествоПриход,
		|	_ОстаткиИПокупки.СтоимостьПокупкиПериод КАК СтоимостьПокупкиПериод,
		|	_ОстаткиИПокупки.НКД_1едПриход КАК НКД_1едПриход,
		|	_ОстаткиИПокупки.СтоимостьПокупкиКупонПериод КАК СтоимостьПокупкиКупонПериод,
		|	ЕСТЬNULL(_ДанныеПродажи.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПродажи,
		|	ЕСТЬNULL(_ДанныеПродажи.КоличествоРасход, 0) КАК КоличествоПродажа,
		|	ЕСТЬNULL(_ДанныеПродажи.ПереоценкаПродажа, 0) КАК ПереоценкаПродажа,
		|	ЕСТЬNULL(_ДанныеПродажи.СтоимостьРасход, 0) КАК СтоимостьПродажа,
		|	ЕСТЬNULL(_ДанныеПродажи.НКД_1едРасход, 0) КАК НКД_1едРасход,
		|	ЕСТЬNULL(_ДанныеПродажи.КупонРасход, 0) КАК КупонПродажа
		|ПОМЕСТИТЬ _ИтоговаяТаблица
		|ИЗ
		|	_ОстаткиИПокупки КАК _ОстаткиИПокупки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеПродажи КАК _ДанныеПродажи
		|		ПО _ОстаткиИПокупки.Партия = _ДанныеПродажи.Партия
		|			И _ОстаткиИПокупки.ЦеннаяБумага = _ДанныеПродажи.ЦеннаяБумага
		|			И _ОстаткиИПокупки.СтрокаПартии = _ДанныеПродажи.СтрокаПартии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ИтоговаяТаблица.Партия КАК Партия,
		|	_ИтоговаяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ИтоговаяТаблица.СтрокаПартии КАК СтрокаПартии,
		|	_ИтоговаяТаблица.ДатаПокупки КАК ДатаПартии,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование)
		|		КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
		|		ИНАЧЕ _ИтоговаяТаблица.Эмитент
		|	КОНЕЦ КАК Эмитент,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
		|	_ИтоговаяТаблица.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК НомерГосРегистрации,
		|	_ИтоговаяТаблица.КоличествоНачало КАК КоличествоНачало,
		|	_ИтоговаяТаблица.ЦенаПокупки КАК ЦенаПокупки,
		|	_ИтоговаяТаблица.НКД_1едНачало КАК НКД_1едНачало,
		|	_ИтоговаяТаблица.СтоимостьПокупкиКупон КАК СтоимостьПокупкиКупон,
		|	_ИтоговаяТаблица.СтоимостьПокупки КАК СтоимостьПокупки,
		|	_ИтоговаяТаблица.НКД_1едКонец КАК НКД_1едКонец,
		|	_ИтоговаяТаблица.ПереоценкаНачало КАК ПереоценкаНачало,
		|	_ИтоговаяТаблица.СтоимостьКупонаКонец КАК СтоимостьКупонаКонец,
		|	_ИтоговаяТаблица.ПереоценкаКонец КАК ПереоценкаКонец,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЕПС = &УчетныйАктивЕПС_РЕПО
		|			ТОГДА _ИтоговаяТаблица.СтоимостьКонец
		|		ИНАЧЕ ЕСТЬNULL(_ПереоценкаЦенныхБумаг.ЦенаКотировки, 0) * _ИтоговаяТаблица.КоличествоКонец
		|	КОНЕЦ КАК СтоимостьКонец,
		|	_ИтоговаяТаблица.КоличествоКонец КАК КоличествоКонец,
		|	_ИтоговаяТаблица.ДатаПогашения КАК ДатаПогашения,
		|	ЕСТЬNULL(_УсловияОферт.ДатаБлижайшейОферты, """") КАК ДатаБлижайшейОферты,
		|	ЕСТЬNULL(КупонныйДоходПоОблигациямСрезПоследних.СтавкаКупона, 0) КАК СтавкаКупона,
		|	ЕСТЬNULL(КупонныйДоходПоОблигациямСрезПоследних.Срок, 0) КАК СрокКупона,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.УчетныйАктивЕПС = &УчетныйАктивЕПС_РЕПО
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(_ПереоценкаЦенныхБумаг.ЦенаКотировки, 0)
		|	КОНЕЦ КАК Котировка,
		|	ЕСТЬNULL(_ПереоценкаЦенныхБумаг.ДатаЦены, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаКотировки,
		|	_ИтоговаяТаблица.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.ДатаПокупки > &ДатаНачала
		|			ТОГДА _ИтоговаяТаблица.ДатаПокупки
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	КОНЕЦ КАК ДатаПокупки,
		|	_ИтоговаяТаблица.КоличествоПриход КАК КоличествоПриход,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.КоличествоПриход > 0
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.СтоимостьПокупкиПериод / _ИтоговаяТаблица.КоличествоПриход КАК ЧИСЛО(27, 12))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПокупкиПериод,
		|	_ИтоговаяТаблица.СтоимостьПокупкиПериод КАК СтоимостьПокупкиПериод,
		|	_ИтоговаяТаблица.НКД_1едПриход КАК НКД_1едПриход,
		|	_ИтоговаяТаблица.СтоимостьПокупкиКупонПериод КАК СтоимостьПокупкиКупонПериод,
		|	_ИтоговаяТаблица.ДатаПродажи КАК ДатаПродажи,
		|	_ИтоговаяТаблица.КоличествоПродажа КАК КоличествоПродажа,
		|	ВЫБОР
		|		КОГДА _ИтоговаяТаблица.КоличествоПродажа > 0
		|			ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.СтоимостьПродажа / _ИтоговаяТаблица.КоличествоПродажа КАК ЧИСЛО(27, 12))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаПродажиПериод,
		|	_ИтоговаяТаблица.ПереоценкаПродажа КАК ПереоценкаПродажа,
		|	_ИтоговаяТаблица.СтоимостьПродажа КАК СтоимостьПродажа,
		|	_ИтоговаяТаблица.НКД_1едРасход КАК НКД_1едРасход,
		|	_ИтоговаяТаблица.КупонПродажа КАК КупонПродажа
		|ИЗ
		|	_ИтоговаяТаблица КАК _ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаОкончанияГраница, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО _ИтоговаяТаблица.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаОкончанияГраница,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Закладные)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Закладные).Банк.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаОкончанияГраница, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_ИтоговаяТаблица.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_ИтоговаяТаблица.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияОферт КАК _УсловияОферт
		|		ПО _ИтоговаяТаблица.ЦеннаяБумага = _УсловияОферт.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КупонныйДоходПоОблигациям.СрезПоследних(&ДатаОкончанияГраница, ) КАК КупонныйДоходПоОблигациямСрезПоследних
		|		ПО _ИтоговаяТаблица.ЦеннаяБумага = КупонныйДоходПоОблигациямСрезПоследних.Облигация
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЦенныеБумагиЦены КАК _ПереоценкаЦенныхБумаг
		|		ПО _ИтоговаяТаблица.ЦеннаяБумага = _ПереоценкаЦенныхБумаг.ЦеннаяБумага
		|			И _ИтоговаяТаблица.Партия = _ПереоценкаЦенныхБумаг.Партия
		|			И _ИтоговаяТаблица.СтрокаПартии = _ПереоценкаЦенныхБумаг.СтрокаПартии
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеннаяБумага,
		|	Партия,
		|	СтрокаПартии
		|ИТОГИ
		|	СУММА(СтоимостьПокупкиКупон),
		|	СУММА(СтоимостьПокупки),
		|	СУММА(ПереоценкаНачало),
		|	СУММА(СтоимостьКупонаКонец),
		|	СУММА(ПереоценкаКонец),
		|	СУММА(СтоимостьКонец),
		|	СУММА(СтоимостьПокупкиПериод),
		|	СУММА(СтоимостьПокупкиКупонПериод),
		|	СУММА(ПереоценкаПродажа),
		|	СУММА(СтоимостьПродажа),
		|	СУММА(КупонПродажа)
		|ПО
		|	ОБЩИЕ,
		|	ЦеннаяБумага,
		|	Партия,
		|	СтрокаПартии";
	
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаОкончанияГраница", Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("УчетныйАктивЕПС_РЕПО", Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО);
	Запрос.УстановитьПараметр("ВнешняяТаблица", ТаблицаСтоимостей);
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДанные = Макет.ПолучитьОбласть("СтрокаДанные");
	ОбластьДанныеПродажа = Макет.ПолучитьОбласть("СтрокаДанныеПродажа");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП=Истина");	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	//Итоги
	СтоимостьПокупкиКупон = 0;	
	ПереоценкаНачало = 0;	
	СтоимостьПокупки = 0;					
	СтоимостьПокупкиКупонПериод = 0;	
	СтоимостьПокупкиПериод = 0;					
	КупонПродажа = 0;	
	ПереоценкаПродажа = 0;	
	СтоимостьПродажа = 0;				
	СтоимостьКупонаКонец = 0;	
	ПереоценкаКонец = 0;	
	СтоимостьКонец = 0;
	
	//строки
	ВыборкаКорень = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаКорень.Следующий() Цикл 
		ВыборкаЦенныеБумаги = ВыборкаКорень.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
		
		Пока ВыборкаЦенныеБумаги.Следующий() Цикл 
			ВыборкаПартии = ВыборкаЦенныеБумаги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПартии.Следующий() Цикл 
				
				ВыборкаСтрокаПартии = ВыборкаПартии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				Пока ВыборкаСтрокаПартии.Следующий() Цикл 
					
					Выборка = ВыборкаСтрокаПартии.Выбрать();  
					НомерЗаписи = 1;
					Пока Выборка.Следующий() Цикл 
						Если НомерЗаписи = 1 Тогда 
							ЗаполнитьЗначенияСвойств(ОбластьДанные.Параметры, Выборка);
							
							Котировка = Выборка.Котировка;
							ДатаКотировки = Выборка.ДатаКотировки;
							Если Выборка.УчетныйАктивЕПС <> Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО 
								И Выборка.Котировка = 0 И Выборка.КоличествоКонец > 0 Тогда 
								Котировка = Выборка.СтоимостьКонец/Выборка.КоличествоКонец;
								ОбластьДанные.Параметры.Котировка = Котировка;
								ДатаКотировки = ЭтотОбъект.Период.ДатаОкончания;
							КонецЕсли;	
							
							ДюрацияИДоходность =  Неопределено;
							Если ТипЗнч(Выборка.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации")  	
								И Котировка > 0 
								И Выборка.УчетныйАктивЕПС <> Справочники.УчетныеАктивыЕПС.ЦенныеБумагиКупленныеПоРЕПО Тогда
								Попытка 
									ДюрацияИДоходность = Справочники.Облигации.ПолучитьДоходностьИДюрацию(Выборка.ЦеннаяБумага, Ложь, Выборка.ДатаПартии, Котировка, ЭтотОбъект.СчетДоверительногоУправления, Неопределено, ДатаКотировки); 
								Исключение 
									//  разобраться почему не считает по некоторым бумаг. разница настроек учета ЕПС и оценки 
								КонецПопытки;	
							КонецЕсли;	
							Если НЕ ДюрацияИДоходность = Неопределено Тогда
								//	ОбластьДанные.Параметры.Дюрация = Окр(ДюрацияИДоходность.Дюрация/365, 4);
								ОбластьДанные.Параметры.ДоходностьКПогашению = Окр(ДюрацияИДоходность.Доходность, 2);
							Иначе 	
								//	ОбластьДанные.Параметры.Дюрация = 0;
								ОбластьДанные.Параметры.ДоходностьКПогашению = 0;			
							КонецЕсли; 
							ДокументРезультат.Вывести(ОбластьДанные);
							
							СтоимостьПокупкиКупон = СтоимостьПокупкиКупон + Выборка.СтоимостьПокупкиКупон;	
							ПереоценкаНачало = ПереоценкаНачало  + Выборка.ПереоценкаНачало;	
							СтоимостьПокупки = СтоимостьПокупки  + Выборка.СтоимостьПокупки;					
							СтоимостьПокупкиКупонПериод = СтоимостьПокупкиКупонПериод + Выборка.СтоимостьПокупкиКупонПериод;	
							СтоимостьПокупкиПериод = СтоимостьПокупкиПериод + Выборка.СтоимостьПокупкиПериод;					
							КупонПродажа = КупонПродажа + Выборка.КупонПродажа;	
							ПереоценкаПродажа = ПереоценкаПродажа + Выборка.ПереоценкаПродажа;	
							СтоимостьПродажа = СтоимостьПродажа + Выборка.СтоимостьПродажа;				
							СтоимостьКупонаКонец = СтоимостьКупонаКонец + Выборка.СтоимостьКупонаКонец;	
							ПереоценкаКонец = ПереоценкаКонец + Выборка.ПереоценкаКонец;	
							СтоимостьКонец = СтоимостьКонец + Выборка.СтоимостьКонец;
							
						Иначе
							ЗаполнитьЗначенияСвойств(ОбластьДанныеПродажа.Параметры, Выборка);	
							ДокументРезультат.Вывести(ОбластьДанныеПродажа);
						КонецЕсли;					
						НомерЗаписи = НомерЗаписи + 1;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
		ОбластьИтог.Параметры.СтоимостьПокупкиКупон = СтоимостьПокупкиКупон;
		ОбластьИтог.Параметры.ПереоценкаНачало = ПереоценкаНачало;
		ОбластьИтог.Параметры.СтоимостьПокупки = СтоимостьПокупки;
		ОбластьИтог.Параметры.СтоимостьПокупкиКупонПериод = СтоимостьПокупкиКупонПериод;
		ОбластьИтог.Параметры.СтоимостьПокупкиПериод = СтоимостьПокупкиПериод;
		ОбластьИтог.Параметры.КупонПродажа = КупонПродажа;
		ОбластьИтог.Параметры.ПереоценкаПродажа = ПереоценкаПродажа;
		ОбластьИтог.Параметры.СтоимостьПродажа = СтоимостьПродажа;
		ОбластьИтог.Параметры.СтоимостьКупонаКонец = СтоимостьКупонаКонец;
		ОбластьИтог.Параметры.ПереоценкаКонец = ПереоценкаКонец;
		ОбластьИтог.Параметры.СтоимостьКонец = СтоимостьКонец;
		
		ДокументРезультат.Вывести(ОбластьИтог);
	КонецЦикла;

	//подписи
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	//ПараметрыВыводаПодписей = Новый Структура;
	//ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	//ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ОбластьПодписи.Параметры.ДолжностьРуководителя = СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий;
		ОбластьПодписи.Параметры.ФИОРуководителя = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	КонецЕсли;
	
	ОбластьПодписи.Параметры.ДатаФормирования = Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'");
	ДокументРезультат.Вывести(ОбластьПодписи);
		
		
	//	ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	//	ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
	//	ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	//КонецЕсли; 
	//
	//РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	//
		
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры	

Функция ПолучитьТаблицуСтоимостей()
	
	Отказ = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
		
	// расчет без послаблений
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",					ЭтотОбъект.Организация);
	ПараметрыРасчета.Вставить("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыРасчета.Вставить("ЦельРасчета",					Справочники.ЦелиРасчета.ЕдиныйПланСчетов);
	ПараметрыРасчета.Вставить("ВалютаУчета",					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	ПараметрыРасчета.Вставить("Дата", 							КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	НастройкиОценки	= РаботаСПереоценкой.ОпределитьНастройкиОценки(ПараметрыРасчета.Дата, ПараметрыРасчета.Организация, ПараметрыРасчета.СчетДоверительногоУправления, ПараметрыРасчета.ЦельРасчета);
	ПараметрыРасчета.Вставить("ВидУчета",							НастройкиОценки.ВидУчетаДляОстатковПартий); 	
	ПараметрыРасчета.Вставить("ВариантРасчетаОценочнойСтоимости",	НастройкиОценки.ВариантРасчетаОценочнойСтоимости); 	
	
	РСП = Документы.РегистрацияСтоимостиПереоценки.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(РСП, ПараметрыРасчета);
	РСП.ДополнительныеСвойства.Вставить("ОчиститьКупоныСуммыИКоличество", Ложь);
	РСП.ДополнительныеСвойства.Вставить("ВыполнятьРасчетПоУказаниюЦБ", Ложь);
	
	РСП.ЗаполнитьСтоимостьПереоценки(Истина, Ложь, Отказ, Неопределено, Ложь, Неопределено, Неопределено, Истина);
	ТаблицаСтоимостей = РСП.СтоимостиПереоценки.Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаСтоимостей;
	 
КонецФункции	

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	СтрСохраняемыеДанные = "Период,Организация,СчетДоверительногоУправления";
	ПараметрыОтчета = Новый Структура(СтрСохраняемыеДанные);
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтотОбъект);
	
	Описание = "";
	
	Для каждого Реквизит Из СтрРазделить(СтрСохраняемыеДанные, ",") Цикл
	
		Описание = Описание + Символы.ПС + Реквизит + ": " + ПараметрыОтчета[Реквизит];
	
	КонецЦикла; 
	
	Описание = Сред(Описание, 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОтчета, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции // ПолучитьПараметрыВыполненияДляСбораСтатистики
